{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "text": "igfod13",
    "file": "images/malmaplogo.png",
    "link": "http://igfod13.github.io/MALmap/"
  },
  "text": {
    "title": "MALmap",
    "more": "MALmap is a visualization of anime using MyAnimeList recommendations. MALMap uses a force-directed layout, which draws mutually recommended anime closer together, while pushing away all other anime series, offering a nice gradient of how different series relate to each other. Each node represents an anime series, while the thickness of each edge represents the number of recommendations on MyAnimeList made between the two series. Recommendations between anime are only recorded if they are made by three or more users (as opposed to two before, due to density issues). <br><br>Recommendation data was taken from MyAnimeList.net on July 30, 2017. This graph was created in Gephi using ForceAtlas and slight Label Adjusting. The different colors representing each series were obtained by running the Louvain method for community detection, which ends up highlighting the different anime genres pretty well. This site was made using the Sigma.js exporter for Gephi. <br><br>This page was created by igfod13 and the source code can be found on <a href=\"https:\/\/github.com\/igfod13\/MALmap\">Github</a>. If you have any questions or suggestions, feel free to PM me on reddit(/u/igfod13) or on MyAnimeList(igfod13). If you are interested in seeing your MyAnimeList mapped to the visualization, follow the instructions on Github or let me know and I can send it to you (hopefully I will find a way to automate this in the future).",
    "intro": "An interactive map of anime based on <a href=\"http:\/\/myanimelist.net\/\">MyAnimeList</a> recommendations. <br><br>Scroll to zoom, click+drag to move, and select circles to see more information on the series. <br><br>The force-directed layout shown means similar anime are generally drawn closer to each other. <br><br>For a map of manga: <a href=\"manga.html\">MALmap-manga</a>."
  },
  "legend": {
    "edgeLabel": "Number of Recommendations",
    "colorLabel": "Detected Communities",
    "nodeLabel": "Anime"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": true,
    "hoverBehavior": "dim"
  },
  "informationPanel": {
    "imageAttribute": "Image",
    "groupByEdgeDirection": false
  },
  "sigma": {
    "graphProperties": {
      "minEdgeSize": 0.25,
      "maxNodeSize": 3,
      "maxEdgeSize": 25,
      "minNodeSize": 0.1
    },
    "drawingProperties": {
      "labelThreshold": 5,
      "hoverFontStyle": "bold",
      "defaultEdgeType": "straight",
      "defaultLabelColor": "#fff",
      "defaultLabelHoverColor": "#fff",
      "defaultLabelSize": 16,
      "activeFontStyle": "bold",
      "fontStyle": "bold",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
	  "defaultNodeActiveColor": "#fff",
	  "nodeActiveColor": "#fff"
    },
    "mouseProperties": {
      "minRatio": 0.75,
      "maxRatio": 20
    }
  }
}